import base64

# base64可以把二进制数据转换为字符串格式的数据展示
# base64会生成+和\这样的数据，在URL中这样的字符时不合法的，所以需要使用url safe编码格式，把+和\替换为-和_
print('start========================================================')
print('start========================================================')
print('start========================================================')
print('start========================================================')
print('start========================================================')

with open('C:\\Users\\rurui\\Desktop\\ss.jpg', 'rb') as f:
    for line in f:
        print(base64.b64encode(line))
        print("===============================================")
        print(base64.urlsafe_b64encode(line))
